package service;

public interface ProductService {
    /*
    * ### **Product Service (Управление продуктами)**

*
*
- `POST /products` — добавить новый продукт
- `GET /products/{id}` — получить информацию о продукте
- `PUT /products/{id}` — обновить информацию о продукте
- `DELETE /products/{id}` — удалить продукт
- `GET /products` — получить список всех продуктов

Далее мы можем приступить к созданию структуры проекта, настройки API Gateway и интеграции сервисов. Ты хочешь, чтобы я написал код сразу или пошагово разобрали процесс?
    * */
}
